:PROPERTIES:
:ID:       a00541a1-b0f0-493d-b325-590b65022115
:END:
#+TITLE: user-interface
#+PROPERTY: header-args: :noweb tangle

* Dependencies
#+NAME: deps
| Dependency         | Description                                 |
|--------------------+---------------------------------------------|
| [[https://github.com/doomemacs/themes][doom-themes]]        | A package for creating and using themes.    |
| [[https://github.com/seagle0128/doom-modeline][doom-modeline]]      | Modelines for doom emacs.                   |
| [[https://github.com/hlissner/emacs-solaire-mode][solaire-mode]]       | Changes colors on non-file buffers.         |
| [[https://github.com/abo-abo/swiper][ivy]]                | Improves a lot of the UI features of Emacs. |
| [[https://github.com/abo-abo/swiper][counsel]]            | Adds improved UI customizations.            |
| [[https://github.com/abo-abo/swiper][swiper]]             | Better search engine.                       |
| [[https://github.com/Yevgnen/ivy-rich][ivy-rich]]           | Adds comments to ivy functions.             |
| [[https://github.com/tumashu/posframe][posframe]]           | Dependency for posframe functions.          |
| [[file:ivy-posframe.org][ivy-posframe]]       | Adds posframe popups to Ivy.                |
| [[https://github.com/abo-abo/hydra][hydra]]              | Adds hydras, nice looking UI popups.        |
| [[file:hydra-posframe.org][hydra-posframe]]     | POS-ifys hydras.                            |
| [[https://github.com/justbur/emacs-which-key][which-key]]          | Tell me what the keys do.                   |
| [[https://github.com/jlr/rainbow-delimiters][rainbow-delimiters]] | Make delimeters pretty.                     |
| [[https://github.com/abo-abo/ace-window][ace-window]]         | Better jumping between windows.             |
| [[https://github.com/d12frosted/flyspell-correct#readme][flyspell-correct]]   | A good, very effective spell checker.       |

#+BEGIN_SRC emacs-lisp :var deps=deps
(ec-load-deps deps)
#+END_SRC

#+RESULTS:
| doom-themes | doom-modeline | solaire-mode | ivy | counsel | swiper | ivy-rich | posframe | ivy-posframe | hydra | hydra-posframe | which-key | rainbow-delimiters | ace-window | flyspell-correct |

** Vars
Here some vars are defined.
#+NAME: var-themes
| Variable                             | Value              |
|--------------------------------------+--------------------|
| doom-themes-enable-bold              | t                  |
| doom-themes-enable-italic            | t                  |
| doom-themes-org-fontify-special-tags | nil                |
| ring-bell-function                   | #'ec-bell-function |
| custom-theme-directory               | (f-expand "./")    |
#+TBLFM: 
#+BEGIN_SRC emacs-lisp :var vars=var-themes
(ec-set-variables vars)
#+END_SRC

#+RESULTS:
| t | t | nil | ec-bell-function | /home/alexandra/Memex/emacs-config/ |
(use-package helpful)
